In [1]:
import pandas as pd
import numpy as np

In [3]:
#Dataframes
df=pd.DataFrame(np.arange(0,8).reshape(4,2),index=['Row1','Row2','Row3','Row4'],columns=['col1','col2'])

In [4]:
df

      col1  col2
Row1     0     1
Row2     2     3
Row3     4     5
Row4     6     7

In [5]:
df.to_csv('trail.csv')

In [6]:
#Accesing elements using row index
df.loc['Row1']

col1    0
col2    1
Name: Row1, dtype: int32

In [7]:
type(df.loc['Row1'])

pandas.core.series.Series

In [8]:
#accessing using rows and columns
df.iloc[:,:]

      col1  col2
Row1     0     1
Row2     2     3
Row3     4     5
Row4     6     7

In [9]:
df.iloc[1:3,:1]

      col1
Row2     2
Row3     4

In [16]:
type(df.iloc[1:3,:1])

pandas.core.frame.DataFrame

In [18]:
#convert dataframe into arrays

df.iloc[:,:].values

array([[0, 1],
       [2, 3],
       [4, 5],
       [6, 7]])

In [19]:
#checking null values in dataframe
df.isnull().sum()

col1    0
col2    0
dtype: int64

In [20]:
df['col1'].value_counts()

6    1
4    1
2    1
0    1
Name: col1, dtype: int64

In [21]:
df['col1'].unique()

array([0, 2, 4, 6], dtype=int64)

In [24]:
df[['col1','col2']]        #pass a list list of cloumns to be retrived

      col1  col2
Row1     0     1
Row2     2     3
Row3     4     5
Row4     6     7

In [27]:
df=pd.read_csv("sample_submission.csv")

In [40]:
df.head(20)

    ID           y
0    1  100.669318
1    2  100.669318
2    3  100.669318
3    4  100.669318
4    5  100.669318
5    8  100.669318
6   10  100.669318
7   11  100.669318
8   12  100.669318
9   14  100.669318
10  15  100.669318
11  16  100.669318
12  17  100.669318
13  19  100.669318
14  20  100.669318
15  21  100.669318
16  22  100.669318
17  23  100.669318
18  26  100.669318
19  28  100.669318

In [29]:
df.isnull().sum()

ID    0
y     0
dtype: int64

In [30]:
df.describe()

                ID             y
count  4209.000000  4.209000e+03
mean   4211.039202  1.006693e+02
std    2423.078926  8.143787e-12
min       1.000000  1.006693e+02
25%    2115.000000  1.006693e+02
50%    4202.000000  1.006693e+02
75%    6310.000000  1.006693e+02
max    8416.000000  1.006693e+02

In [31]:
#To view no.of rows and columns
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4209 entries, 0 to 4208
Data columns (total 2 columns):
ID    4209 non-null int64
y     4209 non-null float64
dtypes: float64(1), int64(1)
memory usage: 65.9 KB

In [33]:
df.index

RangeIndex(start=0, stop=4209, step=1)

In [34]:
df['y']<100

0       False
1       False
2       False
3       False
4       False
        ...
4204    False
4205    False
4206    False
4207    False
4208    False
Name: y, Length: 4209, dtype: bool

In [41]:
from io import StringIO,BytesIO

In [42]:
data=('col1,col2,col3\n'
     'x,y,1\n'
     'a,b,2\n'
     'c,d,3\n')

In [43]:
pd.read_csv(StringIO(data))

  col1 col2  col3
0    x    y     1
1    a    b     2
2    c    d     3

In [47]:
#To retrieve specific columns 'usecols'
df=pd.read_csv(StringIO(data),usecols=['col1','col3'])

In [48]:
df

  col1  col3
0    x     1
1    a     2
2    c     3

In [49]:
df.to_csv('test.csv')

In [53]:
data=('col1,col2,col3,col4\n'
    '1,2,3,4\n'
     '5,6,7,8\n')

In [54]:
df=pd.read_csv(StringIO(data),dtype=object)          #every element is set to string

In [55]:
df

  col1 col2 col3 col4
0    1    2    3    4
1    5    6    7    8

In [56]:
df['col1']

0    1
1    5
Name: col1, dtype: object

In [57]:
df['col1'][1]                        #string

'5'

In [58]:
df=pd.read_csv(StringIO(data),dtype=int)             #every element is set to int

In [59]:
df['col1'][1]                         #int

5

In [60]:
df=pd.read_csv(StringIO(data),dtype={'col1':int,'col2':float})

In [61]:
df                                                  #col1->int col2->float

   col1  col2  col3  col4
0     1   2.0     3     4
1     5   6.0     7     8

In [62]:
data = ('index,a,b,c\n'
           '4,apple,bat,5.7\n'
            '8,orange,cow,10')

In [63]:
df=pd.read_csv(StringIO(data))

In [64]:
df

   index       a    b     c
0      4   apple  bat   5.7
1      8  orange  cow  10.0

In [69]:
df=pd.read_csv(StringIO(data),index_col=0)           #1st column is index

In [66]:
df

            a    b     c
index
4       apple  bat   5.7
8      orange  cow  10.0

In [67]:
df=pd.read_csv(StringIO(data),index_col=2)            #3rd column is index

In [68]:
df

     index       a     c
b
bat      4   apple   5.7
cow      8  orange  10.0

In [75]:

data = ('a,b,c\n'
           '4,apple,bat\n'
            '8,orange,cow')

In [76]:
df=pd.read_csv(StringIO(data))

In [77]:
df

   a       b    c
0  4   apple  bat
1  8  orange  cow

In [73]:
df=pd.read_csv(StringIO(data),index_col=False)

In [74]:
df

   a       b    c
0  4   apple  bat
1  8  orange  cow

In [78]:
data = 'a,b\n"hello, \\"Bob\\", nice to see you",5'

In [ ]:
df=pd.read_csv(StringIO(data),escapechar=)